/*
Створити структуру Зооклуб.
Створити клас Person, який описати двома полями : ім’я, вік.
Створити клас Animal, який описати двома полями : тип тваринки(кіт,пес), ім’я тваринки.
Кожна людина може мати багато тваринок. Але одна тваринка належить лише одній людині.

Map<Person, List<Animal>> map;

Реалізувати консольне меню(НЕ обов’язково), таким чином, щоб можна було:

Додати людину до клубу
Додати тваринку до людини
Видалити(забрати) тваринку від людини
Видалити людину з клубу
Вивести на екран зооклуб
Вийти з програми

Використати для побудови меню Switch.

 */

package checking.les_6.present_15.task_3;

import java.util.List;

public class MainActivity {
    public static void main(String[] args) {

        Service<Person, List<Animal>> service = new Service<>();
        service.mainMenu();
    }
}
