/*
Написати консольну програму для роботи з Enums.
Створити енум Сезони, в якому оголосити такі константи : Зима , Весна, Літо, Осінь.
Створити енум Місяці, в якому створити 12 констант- місяці року(Січень, Лютий, Грудень ),
    оголосити змінну дні, та змінну сезон типу Сезон, як поле енума.
    Створити конструктор з визначеними параметрами в енумі Місяці, в який як параметри передати змінну дні та сезон.
    Описати getters до даних полів (дні, сезони).
    Створити консольне меню, в якому реалізувати наступні пункти :
Перевірити чи є такий місяць (місяць вводимо з консолі, передбачити, щоб регістр букв був не важливим).
Вивести всі місяці з такою ж порою року.
Вивести всі місяці які мають таку саму кількість днів.
Вивести на екран всі місяці які мають меншу кількість днів.
Вивести на екран всі місяці які мають більшу кількість днів.
Вивести на екран наступну пору року.
Вивести на екран попередню пору року.
Вивести на екран всі місяці які мають парну кількість днів.
Вивести на екран всі місяці які мають непарну кількість днів.
Вивести на екран чи введений з консолі місяць має парну кількість днів.

 */

package checking.les_10.present_8.task_3;

public class MainActivity {
    public static void main(String[] args) {

        Calendar.start();
    }
}
